Table of Contents
 Class ReinfBarOnEdge
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing reinforcement bar input on edge in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarOnEdge : ReinforcementGroup
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarOnEdge
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ReinfBarOnEdge()
Constructor
public ReinfBarOnEdge()
Properties
 AnchorLength
Anchor length of main bars, if MasterComponent is opening
public double AnchorLength { get; set; }
Property Value
double
 BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
public Vector3D BarDistance { get; set; }
Property Value
Vector3D
 Distance
Distance between reinforcement layers
public double Distance { get; set; }
Property Value
double
 EdgePositionType
Position of reinforcement on edge
public EdgePositionType EdgePositionType { get; set; }
Property Value
EdgePositionType
 ExtendDistanceBegin
Distance of extension of beginning
public double ExtendDistanceBegin { get; set; }
Property Value
double
 ExtendDistanceEnd
Distance of extension of end
public double ExtendDistanceEnd { get; set; }
Property Value
double
 ExtendTypeBegin
type of extension of beginning of bar
public BarEndExtendType ExtendTypeBegin { get; set; }
Property Value
BarEndExtendType
 ExtendTypeEnd
type of extension of end of bar
public BarEndExtendType ExtendTypeEnd { get; set; }
Property Value
BarEndExtendType
 Length
length of bar
public double Length { get; set; }
Property Value
double
 MasterComponent
Master component of reinforcement
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterEdge
Master edge on Outline of MasterComponent
public ReferenceElement MasterEdge { get; set; }
Property Value
ReferenceElement
 NumOfLayers
Number of layers
public int NumOfLayers { get; set; }
Property Value
int
 PositionOnEdge
Position of beginning of bar from start or end of edge
public double PositionOnEdge { get; set; }
Property Value
double
 Edit this page